Tekla Open API Reference for Tekla Structures 2025
LinkBase.Resize Method
 Resizes the object. The scaling type is changed to ScaleToFit.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Resize(
	Size size
)
Public Function Resize (
	size As Size
) As Boolean
Parameters
size
Type: Tekla.Structures.Drawing.Size
The width and height to be used.
Return Value
Type: Boolean
True.
Implements
IResizeable.Resize(Size)
See Also
Reference
LinkBase Class
Tekla.Structures.Drawing Namespace
Tekla.Structures.Drawing.ScalingOptions